app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @request = Request.find(params[:id])

INSERT INTO "requests" ("created_at", "fromLoc", "meetingTime", "open", "responseIds", "toLoc", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @request = Request.new(params[:request])
    logger.debug "Post should be valid: #{@request.valid?}"

    respond_to do |format|
      if @request.save